plot/stage2/least_conn_output.txt
Running 5s test @ http://127.0.0.1:8080
  1 threads and 50 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   703.10us  226.24us   1.26ms   70.66%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  677.00us
 75.000%  840.00us
 90.000%    0.99ms
 99.000%    1.26ms
 99.900%    2.28ms
 99.990%    4.74ms
 99.999%    4.78ms
100.000%    4.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.180     0.000000            1         1.00
       0.446     0.100000         4975         1.11
       0.510     0.200000         9993         1.25
       0.566     0.300000        14993         1.43
       0.619     0.400000        19912         1.67
       0.677     0.500000        24912         2.00
       0.707     0.550000        27379         2.22
       0.737     0.600000        29820         2.50
       0.770     0.650000        32360         2.86
       0.803     0.700000        34768         3.33
       0.840     0.750000        37315         4.00
       0.859     0.775000        38510         4.44
       0.881     0.800000        39745         5.00
       0.904     0.825000        40976         5.71
       0.931     0.850000        42217         6.67
       0.959     0.875000        43480         8.00
       0.975     0.887500        44080         8.89
       0.993     0.900000        44714        10.00
       1.012     0.912500        45340        11.43
       1.032     0.925000        45959        13.33
       1.054     0.937500        46579        16.00
       1.065     0.943750        46873        17.78
       1.078     0.950000        47185        20.00
       1.094     0.956250        47513        22.86
       1.112     0.962500        47817        26.67
       1.133     0.968750        48120        32.00
       1.146     0.971875        48277        35.56
       1.160     0.975000        48428        40.00
       1.175     0.978125        48582        45.71
       1.189     0.981250        48736        53.33
       1.211     0.984375        48891        64.00
       1.222     0.985938        48974        71.11
       1.233     0.987500        49046        80.00
       1.252     0.989062        49123        91.43
       1.270     0.990625        49205       106.67
       1.288     0.992188        49280       128.00
       1.297     0.992969        49323       142.22
       1.307     0.993750        49357       160.00
       1.325     0.994531        49397       182.86
       1.345     0.995313        49438       213.33
       1.369     0.996094        49475       256.00
       1.386     0.996484        49495       284.44
       1.408     0.996875        49511       320.00
       1.434     0.997266        49531       365.71
       1.478     0.997656        49551       426.67
       1.526     0.998047        49571       512.00
       1.546     0.998242        49579       568.89
       1.594     0.998437        49589       640.00
       1.931     0.998633        49599       731.43
       1.984     0.998828        49608       853.33
       2.283     0.999023        49618      1024.00
       2.311     0.999121        49623      1137.78
       2.381     0.999219        49628      1280.00
       2.711     0.999316        49633      1462.86
       2.721     0.999414        49637      1706.67
       2.761     0.999512        49643      2048.00
       2.763     0.999561        49645      2275.56
       2.765     0.999609        49647      2560.00
       2.775     0.999658        49650      2925.71
       2.785     0.999707        49652      3413.33
       3.915     0.999756        49654      4096.00
       3.937     0.999780        49656      4551.11
       3.949     0.999805        49657      5120.00
       3.953     0.999829        49658      5851.43
       3.971     0.999854        49659      6826.67
       3.975     0.999878        49660      8192.00
       4.735     0.999890        49661      9102.22
       4.747     0.999902        49662     10240.00
       4.747     0.999915        49662     11702.86
       4.759     0.999927        49663     13653.33
       4.759     0.999939        49663     16384.00
       4.763     0.999945        49664     18204.44
       4.763     0.999951        49664     20480.00
       4.763     0.999957        49664     23405.71
       4.767     0.999963        49665     27306.67
       4.767     0.999969        49665     32768.00
       4.767     0.999973        49665     36408.89
       4.767     0.999976        49665     40960.00
       4.767     0.999979        49665     46811.43
       4.775     0.999982        49666     54613.33
       4.775     1.000000        49666          inf
#[Mean    =        0.703, StdDeviation   =        0.226]
#[Max     =        4.772, Total count    =        49666]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  49667 requests in 5.00s, 42.44MB read
Requests/sec:   9932.96
Transfer/sec:      8.49MB
Running 5s test @ http://127.0.0.1:8080
  1 threads and 50 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.31ms  598.80us   3.39ms   80.25%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.16ms
 75.000%    1.56ms
 90.000%    2.04ms
 99.000%    3.39ms
 99.900%    5.35ms
 99.990%    8.26ms
 99.999%    9.41ms
100.000%    9.42ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.143     0.000000            1         1.00
       0.747     0.100000         9951         1.11
       0.859     0.200000        19971         1.25
       0.956     0.300000        29856         1.43
       1.053     0.400000        39853         1.67
       1.161     0.500000        49722         2.00
       1.226     0.550000        54667         2.22
       1.298     0.600000        59654         2.50
       1.382     0.650000        64615         2.86
       1.468     0.700000        69576         3.33
       1.559     0.750000        74519         4.00
       1.609     0.775000        77011         4.44
       1.666     0.800000        79519         5.00
       1.731     0.825000        81974         5.71
       1.807     0.850000        84478         6.67
       1.907     0.875000        86945         8.00
       1.969     0.887500        88186         8.89
       2.037     0.900000        89423        10.00
       2.111     0.912500        90701        11.43
       2.189     0.925000        91911        13.33
       2.281     0.937500        93152        16.00
       2.335     0.943750        93781        17.78
       2.399     0.950000        94400        20.00
       2.475     0.956250        95013        22.86
       2.549     0.962500        95639        26.67
       2.643     0.968750        96254        32.00
       2.693     0.971875        96571        35.56
       2.765     0.975000        96873        40.00
       2.865     0.978125        97189        45.71
       2.963     0.981250        97494        53.33
       3.073     0.984375        97805        64.00
       3.141     0.985938        97960        71.11
       3.219     0.987500        98115        80.00
       3.311     0.989062        98270        91.43
       3.445     0.990625        98425       106.67
       3.665     0.992188        98580       128.00
       3.767     0.992969        98660       142.22
       3.853     0.993750        98736       160.00
       3.965     0.994531        98814       182.86
       4.085     0.995313        98892       213.33
       4.187     0.996094        98968       256.00
       4.275     0.996484        99009       284.44
       4.351     0.996875        99047       320.00
       4.495     0.997266        99085       365.71
       4.615     0.997656        99125       426.67
       4.795     0.998047        99162       512.00
       4.851     0.998242        99182       568.89
       4.915     0.998437        99201       640.00
       5.035     0.998633        99221       731.43
       5.239     0.998828        99240       853.33
       5.367     0.999023        99259      1024.00
       5.443     0.999121        99269      1137.78
       5.599     0.999219        99279      1280.00
       5.779     0.999316        99290      1462.86
       5.927     0.999414        99299      1706.67
       5.983     0.999512        99308      2048.00
       6.443     0.999561        99313      2275.56
       6.523     0.999609        99318      2560.00
       6.991     0.999658        99324      2925.71
       7.023     0.999707        99327      3413.33
       7.455     0.999756        99332      4096.00
       7.907     0.999780        99335      4551.11
       7.971     0.999805        99337      5120.00
       8.011     0.999829        99340      5851.43
       8.163     0.999854        99342      6826.67
       8.239     0.999878        99344      8192.00
       8.255     0.999890        99346      9102.22
       8.271     0.999902        99348     10240.00
       8.271     0.999915        99348     11702.86
       8.279     0.999927        99349     13653.33
       8.287     0.999939        99350     16384.00
       8.303     0.999945        99352     18204.44
       8.303     0.999951        99352     20480.00
       8.303     0.999957        99352     23405.71
       9.359     0.999963        99353     27306.67
       9.359     0.999969        99353     32768.00
       9.407     0.999973        99355     36408.89
       9.407     0.999976        99355     40960.00
       9.407     0.999979        99355     46811.43
       9.407     0.999982        99355     54613.33
       9.407     0.999985        99355     65536.00
       9.407     0.999986        99355     72817.78
       9.407     0.999988        99355     81920.00
       9.407     0.999989        99355     93622.86
       9.423     0.999991        99356    109226.67
       9.423     1.000000        99356          inf
#[Mean    =        1.308, StdDeviation   =        0.599]
#[Max     =        9.416, Total count    =        99356]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  99357 requests in 5.00s, 84.90MB read
Requests/sec:  19869.79
Transfer/sec:     16.98MB
Running 5s test @ http://127.0.0.1:8080
  1 threads and 50 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.91ms    1.51ms   8.31ms   72.38%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.52ms
 75.000%    4.91ms
 90.000%    5.92ms
 99.000%    8.31ms
 99.900%   11.26ms
 99.990%   13.87ms
 99.999%   14.88ms
100.000%   15.26ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.233     0.000000            1         1.00
       2.319     0.100000        14944         1.11
       2.685     0.200000        29892         1.25
       2.949     0.300000        44753         1.43
       3.205     0.400000        59665         1.67
       3.523     0.500000        74587         2.00
       3.739     0.550000        82019         2.22
       4.025     0.600000        89458         2.50
       4.339     0.650000        96988         2.86
       4.639     0.700000       104457         3.33
       4.915     0.750000       111887         4.00
       5.047     0.775000       115603         4.44
       5.183     0.800000       119331         5.00
       5.335     0.825000       123024         5.71
       5.491     0.850000       126734         6.67
       5.675     0.875000       130438         8.00
       5.791     0.887500       132334         8.89
       5.919     0.900000       134171        10.00
       6.043     0.912500       136029        11.43
       6.195     0.925000       137903        13.33
       6.383     0.937500       139789        16.00
       6.487     0.943750       140719        17.78
       6.619     0.950000       141637        20.00
       6.775     0.956250       142561        22.86
       6.987     0.962500       143497        26.67
       7.239     0.968750       144423        32.00
       7.375     0.971875       144881        35.56
       7.519     0.975000       145349        40.00
       7.651     0.978125       145813        45.71
       7.775     0.981250       146281        53.33
       7.899     0.984375       146750        64.00
       7.983     0.985938       146985        71.11
       8.087     0.987500       147212        80.00
       8.215     0.989062       147449        91.43
       8.399     0.990625       147686       106.67
       8.591     0.992188       147909       128.00
       8.671     0.992969       148026       142.22
       8.807     0.993750       148144       160.00
       8.927     0.994531       148259       182.86
       9.087     0.995313       148382       213.33
       9.263     0.996094       148496       256.00
       9.335     0.996484       148549       284.44
       9.479     0.996875       148607       320.00
       9.591     0.997266       148665       365.71
       9.751     0.997656       148725       426.67
       9.927     0.998047       148782       512.00
      10.031     0.998242       148810       568.89
      10.159     0.998437       148840       640.00
      10.375     0.998633       148870       731.43
      10.679     0.998828       148899       853.33
      11.391     0.999023       148929      1024.00
      11.487     0.999121       148941      1137.78
      11.655     0.999219       148956      1280.00
      12.039     0.999316       148971      1462.86
      12.207     0.999414       148986      1706.67
      12.447     0.999512       149000      2048.00
      12.511     0.999561       149008      2275.56
      12.543     0.999609       149016      2560.00
      12.815     0.999658       149022      2925.71
      13.207     0.999707       149030      3413.33
      13.351     0.999756       149036      4096.00
      13.591     0.999780       149041      4551.11
      13.607     0.999805       149044      5120.00
      13.623     0.999829       149047      5851.43
      13.839     0.999854       149053      6826.67
      13.863     0.999878       149055      8192.00
      13.871     0.999890       149057      9102.22
      13.879     0.999902       149058     10240.00
      13.903     0.999915       149060     11702.86
      13.911     0.999927       149062     13653.33
      13.919     0.999939       149063     16384.00
      14.439     0.999945       149064     18204.44
      14.463     0.999951       149065     20480.00
      14.719     0.999957       149066     23405.71
      14.783     0.999963       149067     27306.67
      14.823     0.999969       149068     32768.00
      14.823     0.999973       149068     36408.89
      14.839     0.999976       149069     40960.00
      14.839     0.999979       149069     46811.43
      14.855     0.999982       149070     54613.33
      14.855     0.999985       149070     65536.00
      14.855     0.999986       149070     72817.78
      14.879     0.999988       149071     81920.00
      14.879     0.999989       149071     93622.86
      14.879     0.999991       149071    109226.67
      14.879     0.999992       149071    131072.00
      14.879     0.999993       149071    145635.56
      15.255     0.999994       149072    163840.00
      15.255     1.000000       149072          inf
#[Mean    =        3.914, StdDeviation   =        1.513]
#[Max     =       15.248, Total count    =       149072]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149161 requests in 5.00s, 127.46MB read
Requests/sec:  29820.37
Transfer/sec:     25.48MB
Running 5s test @ http://127.0.0.1:8080
  1 threads and 50 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    10.50ms    6.50ms  31.42ms   76.66%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.38ms
 75.000%   13.44ms
 90.000%   19.95ms
 99.000%   31.42ms
 99.900%   40.22ms
 99.990%   44.83ms
 99.999%   45.15ms
100.000%   45.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.212     0.000000            1         1.00
       4.327     0.100000        19864         1.11
       5.519     0.200000        39710         1.25
       6.447     0.300000        59546         1.43
       7.351     0.400000        79353         1.67
       8.383     0.500000        99254         2.00
       8.991     0.550000       109135         2.22
       9.839     0.600000       118982         2.50
      10.855     0.650000       128946         2.86
      11.951     0.700000       138839         3.33
      13.439     0.750000       148707         4.00
      14.311     0.775000       153671         4.44
      15.175     0.800000       158614         5.00
      16.167     0.825000       163583         5.71
      17.199     0.850000       168539         6.67
      18.399     0.875000       173559         8.00
      19.135     0.887500       175985         8.89
      19.951     0.900000       178488        10.00
      20.703     0.912500       180928        11.43
      21.631     0.925000       183407        13.33
      22.767     0.937500       185895        16.00
      23.487     0.943750       187116        17.78
      24.255     0.950000       188359        20.00
      24.959     0.956250       189595        22.86
      25.663     0.962500       190836        26.67
      26.447     0.968750       192109        32.00
      26.895     0.971875       192694        35.56
      27.503     0.975000       193323        40.00
      28.127     0.978125       193941        45.71
      28.719     0.981250       194555        53.33
      29.615     0.984375       195174        64.00
      30.127     0.985938       195484        71.11
      30.623     0.987500       195797        80.00
      31.055     0.989062       196098        91.43
      31.727     0.990625       196415       106.67
      32.751     0.992188       196725       128.00
      33.183     0.992969       196874       142.22
      33.695     0.993750       197037       160.00
      34.367     0.994531       197191       182.86
      35.007     0.995313       197341       213.33
      35.903     0.996094       197500       256.00
      36.255     0.996484       197570       284.44
      36.735     0.996875       197649       320.00
      37.247     0.997266       197729       365.71
      37.695     0.997656       197806       426.67
      38.719     0.998047       197880       512.00
      38.975     0.998242       197920       568.89
      39.199     0.998437       197957       640.00
      39.487     0.998633       197999       731.43
      39.839     0.998828       198035       853.33
      40.287     0.999023       198074      1024.00
      40.575     0.999121       198092      1137.78
      40.863     0.999219       198112      1280.00
      41.311     0.999316       198131      1462.86
      41.599     0.999414       198154      1706.67
      41.823     0.999512       198171      2048.00
      41.887     0.999561       198179      2275.56
      43.327     0.999609       198190      2560.00
      43.615     0.999658       198200      2925.71
      43.839     0.999707       198209      3413.33
      43.999     0.999756       198218      4096.00
      44.287     0.999780       198224      4551.11
      44.447     0.999805       198228      5120.00
      44.511     0.999829       198235      5851.43
      44.543     0.999854       198237      6826.67
      44.735     0.999878       198242      8192.00
      44.831     0.999890       198251      9102.22
      44.831     0.999902       198251     10240.00
      44.831     0.999915       198251     11702.86
      44.895     0.999927       198253     13653.33
      44.927     0.999939       198254     16384.00
      45.087     0.999945       198256     18204.44
      45.151     0.999951       198264     20480.00
      45.151     0.999957       198264     23405.71
      45.151     0.999963       198264     27306.67
      45.151     0.999969       198264     32768.00
      45.151     0.999973       198264     36408.89
      45.151     0.999976       198264     40960.00
      45.151     0.999979       198264     46811.43
      45.151     0.999982       198264     54613.33
      45.151     0.999985       198264     65536.00
      45.151     0.999986       198264     72817.78
      45.151     0.999988       198264     81920.00
      45.151     0.999989       198264     93622.86
      45.183     0.999991       198265    109226.67
      45.183     0.999992       198265    131072.00
      45.183     0.999993       198265    145635.56
      45.183     0.999994       198265    163840.00
      45.183     0.999995       198265    187245.71
      45.247     0.999995       198266    218453.33
      45.247     1.000000       198266          inf
#[Mean    =       10.497, StdDeviation   =        6.503]
#[Max     =       45.216, Total count    =       198266]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  198424 requests in 5.00s, 169.56MB read
Requests/sec:  39669.51
Transfer/sec:     33.90MB
Running 5s test @ http://127.0.0.1:8080
  1 threads and 50 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   360.58ms  384.47ms   1.19s    77.82%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  186.37ms
 75.000%  698.88ms
 90.000%    1.03s 
 99.000%    1.19s 
 99.900%    1.24s 
 99.990%    1.25s 
 99.999%    1.25s 
100.000%    1.25s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.245     0.000000            1         1.00
       8.319     0.100000        21109         1.11
      13.775     0.200000        42183         1.25
      27.855     0.300000        63289         1.43
      53.279     0.400000        84364         1.67
     186.367     0.500000       105457         2.00
     340.479     0.550000       116059         2.22
     375.807     0.600000       126566         2.50
     435.711     0.650000       137111         2.86
     626.175     0.700000       147669         3.33
     698.879     0.750000       158195         4.00
     741.375     0.775000       163500         4.44
     780.287     0.800000       168787         5.00
     821.247     0.825000       174078         5.71
     851.967     0.850000       179479         6.67
     932.351     0.875000       184551         8.00
    1007.103     0.887500       187194         8.89
    1026.047     0.900000       189869        10.00
    1037.311     0.912500       192466        11.43
    1047.551     0.925000       195226        13.33
    1055.743     0.937500       197829        16.00
    1060.863     0.943750       199056        17.78
    1064.959     0.950000       200427        20.00
    1068.031     0.956250       201932        22.86
    1071.103     0.962500       203095        26.67
    1075.199     0.968750       204419        32.00
    1077.247     0.971875       205025        35.56
    1080.319     0.975000       205818        40.00
    1082.367     0.978125       206476        45.71
    1087.487     0.981250       206958        53.33
    1111.039     0.984375       207616        64.00
    1118.207     0.985938       207961        71.11
    1136.639     0.987500       208271        80.00
    1175.551     0.989062       208607        91.43
    1203.199     0.990625       208939       106.67
    1214.463     0.992188       209358       128.00
    1215.487     0.992969       209495       142.22
    1217.535     0.993750       209630       160.00
    1223.679     0.994531       209755       182.86
    1227.775     0.995313       210002       213.33
    1229.823     0.996094       210104       256.00
    1230.847     0.996484       210265       284.44
    1230.847     0.996875       210265       320.00
    1231.871     0.997266       210388       365.71
    1232.895     0.997656       210454       426.67
    1234.943     0.998047       210551       512.00
    1234.943     0.998242       210551       568.89
    1236.991     0.998437       210602       640.00
    1238.015     0.998633       210633       731.43
    1240.063     0.998828       210685       853.33
    1241.087     0.999023       210733      1024.00
    1241.087     0.999121       210733      1137.78
    1244.159     0.999219       210748      1280.00
    1245.183     0.999316       210821      1462.86
    1245.183     0.999414       210821      1706.67
    1245.183     0.999512       210821      2048.00
    1245.183     0.999561       210821      2275.56
    1247.231     0.999609       210852      2560.00
    1247.231     0.999658       210852      2925.71
    1247.231     0.999707       210852      3413.33
    1248.255     0.999756       210902      4096.00
    1248.255     0.999780       210902      4551.11
    1248.255     0.999805       210902      5120.00
    1248.255     0.999829       210902      5851.43
    1248.255     0.999854       210902      6826.67
    1248.255     0.999878       210902      8192.00
    1248.255     0.999890       210902      9102.22
    1248.255     0.999902       210902     10240.00
    1248.255     0.999915       210902     11702.86
    1248.255     0.999927       210902     13653.33
    1248.255     0.999939       210902     16384.00
    1248.255     0.999945       210902     18204.44
    1248.255     0.999951       210902     20480.00
    1248.255     0.999957       210902     23405.71
    1248.255     0.999963       210902     27306.67
    1248.255     0.999969       210902     32768.00
    1248.255     0.999973       210902     36408.89
    1248.255     0.999976       210902     40960.00
    1250.303     0.999979       210907     46811.43
    1250.303     1.000000       210907          inf
#[Mean    =      360.577, StdDeviation   =      384.470]
#[Max     =     1249.280, Total count    =       210907]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  210935 requests in 5.00s, 180.27MB read
Requests/sec:  42159.49
Transfer/sec:     36.03MB